openfoam_case/0/H2
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2;
}

dimensions  [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    main_inlet
    {
        type    fixedValue;
        value   uniform 0;          // pure CH4
    }

    branch_inlet
    {
        type    fixedValue;
        value   uniform 1;          // pure H2
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    wall
    {
        type    zeroGradient;
    }
}
