openfoam_case/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

// Buoyant pressure decomposition:  p = p_rgh + rho*g*h
// This is what rhoReactingBuoyantFoam actually solves for, and ensures
// the hydrostatic component does not pollute the momentum equation.

dimensions  [1 -1 -2 0 0 0 0];

internalField   uniform 6900000;        // operating pressure reference

boundaryField
{
    main_inlet
    {
        // Pressure gradient adjusted to balance body forces (gravity)
        type    fixedFluxPressure;
        value   uniform 6900000;
    }

    branch_inlet
    {
        type    fixedFluxPressure;
        value   uniform 6900000;
    }

    outlet
    {
        // Fixed p_rgh at outlet: reference pressure with hydrostatic
        // contribution already subtracted.
        type    prghPressure;
        p       uniform 6900000;
        value   uniform 6900000;
    }

    wall
    {
        type    fixedFluxPressure;
        value   uniform 6900000;
    }
}
