openfoam_case/constant/reactions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      reactions;
}

// No reactions — empty file
species ( H2 CH4 );
reactions ();
