openfoam_case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Turbulent Schmidt number (default 0.7 in Fluent; set to 0.5 per setup)
Sct     0.5;
