openfoam_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Background hex mesh enclosing the T-junction domain.
// Main pipe: X,Y in [-0.25, 0.25], Z in [-0.1, 9.3]
// Branch:    extends to Y = 1.5 m (above junction)
// Cell size ~20 mm (refined by snappyHexMesh later).

scale   1;      // already in metres

xMin   -0.30;
xMax    0.30;
yMin   -0.30;
yMax    1.50;
zMin   -0.10;
zMax    9.30;

vertices
(
    ($xMin $yMin $zMin)   // 0
    ($xMax $yMin $zMin)   // 1
    ($xMax $yMax $zMin)   // 2
    ($xMin $yMax $zMin)   // 3
    ($xMin $yMin $zMax)   // 4
    ($xMax $yMin $zMax)   // 5
    ($xMax $yMax $zMax)   // 6
    ($xMin $yMax $zMax)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 90 470) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (0 3 2 1)   // zMin
            (4 5 6 7)   // zMax
            (0 1 5 4)   // yMin
            (3 7 6 2)   // yMax
            (0 4 7 3)   // xMin
            (1 2 6 5)   // xMax
        );
    }
);

mergePatchPairs
(
);
