openfoam_case/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue H2  0
    volScalarFieldValue CH4 1
    volVectorFieldValue U   (0 0 10)
);

regions
(
    // Patch the branch region with pure H2 and branch velocity.
    // Cylinder enclosing the branch pipe: centred at junction,
    // extending along +Y from pipe wall (y=0.23) to branch inlet (y=1.38).
    cylinderToCell
    {
        p1      (0 0.20 4.6);       // slightly below junction centre
        p2      (0 1.40 4.6);       // above branch inlet
        radius  0.06;               // slightly larger than R2 = 0.0575 m

        fieldValues
        (
            volScalarFieldValue H2  1
            volScalarFieldValue CH4 0
            volVectorFieldValue U   (0 -32 0)   // branch flow along -Y
        );
    }
);
